# ArcSin

## Description
Function ArcSin returns the arc sine (in radians) of the specified value.

```pascal
FUNCTION ArcSin(v : REAL): REAL;
```

```python
def vs.ArcSin(v):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|v|REAL|Numeric value for which to find the sine.|

## Version
Availability: from All Versions

## Category
* Math - General